#include "mewtwo.h"

// ---------------------------------------------------------------------- //
//  コンストラクタ
// ---------------------------------------------------------------------- //
CMewtwo::CMewtwo()
	: mLevel(1), mHitpoint(120), mAttackPoint(60), mDefencePoint(70)
{
	std::cout << "ミュウツー誕生！\n";

	std::cout << "レベル ：" << mLevel << "\n";
	std::cout << "HP　　 ：" << mHitpoint << "\n";
	std::cout << "攻撃力 ：" << mAttackPoint << "\n";
	std::cout << "防御力 ：" << mDefencePoint << "\n";
}

// ---------------------------------------------------------------------- //
//  デストラクタ
// ---------------------------------------------------------------------- //
CMewtwo::~CMewtwo()
{
}

// ---------------------------------------------------------------------- //
//  攻撃
// ---------------------------------------------------------------------- //

int CMewtwo::Attack()
{
	std::cout << "サイコキネシス！\n";
	return mAttackPoint;
}

// ---------------------------------------------------------------------- //
//  ダメージ
// ---------------------------------------------------------------------- //

void CMewtwo::Damage(int aDamage)
{
	mHitpoint -= aDamage;
	std::cout << "ミュウツーはダメージを受けた\n";
	std::cout << "HP　　 :" << mHitpoint << "\n";
	if (mHitpoint <= 0)
	{
		std::cout << "ミュウツーは倒れた\n";
	}
}