#include "monster.h"

CMonster::CMonster()
{

}

CMonster::~CMonster()
{
}

//// ------------------------------------------------------------------------- //
////  攻撃.
//// ------------------------------------------------------------------------- //
//int CMonster::Attack()
//{
//    std::cout << "" << "の" << "攻撃！\n";
//    std::cout << "" << "\n";
//    return mAttackPoint;
//}
//
//// ------------------------------------------------------------------------- //
////  ダメージ.
//// ------------------------------------------------------------------------- //
//void CMonster::Damage(int aDamagePoint)
//{
//    mHitPoint -= aDamagePoint;
//
//    std::cout << "" << "は" << "攻撃を受けた。\n";
//    std::cout << aDamagePoint << " ダメージ！" << "\n";
//    std::cout << "残りHP = " << mHitPoint << "\n";
//    if (mHitPoint <= 0)
//    {
//        std::cout << "" << "は" << "倒れた。\n";
//    }
//}